Repository: badasswp/ai-plus-block-editor
Catalog: languages/ai-plus-block-editor-*.po
Languages: ar, he_il, hi_in, zh_cn

source: Fatal Error: Composer not setup in %s
ar: خطأ فادح: لم يتم إعداد الملحن في %s
he_il: שגיאה חמורה: המלחין לא הוגדר ב-%s
hi_in: घातक त्रुटि: कम्पोज़र %s में सेट नहीं किया गया
zh_cn: 致命错误：%s 中未设置 Composer

source: AI + Block Editor
ar: الذكاء الاصطناعي + محرر الكتل
he_il: ‫AI + עורך בלוק
hi_in: AI + ब्लॉक संपादक
zh_cn: AI+区块编辑器

source: Add AI Capabilities to the WP Block Editor.
ar: أضف قدرات الذكاء الاصطناعي إلى WP Block Editor.
he_il: הוסף יכולות AI לעורך בלוק WP.
hi_in: WP ब्लॉक संपादक में AI क्षमताएं जोड़ें।
zh_cn: 向 WP 块编辑器添加 AI 功能。

source: Actions
ar: الإجراءات
he_il: פעולות
hi_in: कार्रवाइयाँ
zh_cn: 行动

source: Save Changes
ar: حفظ التغييرات
he_il: שמור שינויים
hi_in: बदलाव सहेजें
zh_cn: 保存更改

source: General Options
ar: خيارات عامة
he_il: אפשרויות כלליות
hi_in: आम विकल्प
zh_cn: 一般选项

source: AI Provider
ar: مزود الذكاء الاصطناعي
he_il: ספק AI
hi_in: एआई प्रदाता
zh_cn: 人工智能提供商

source: Open AI
ar: افتح الذكاء الاصطناعي
hi_in: ओपन एआई
zh_cn: 人工智能提供商

source: Enable Open AI
ar: تمكين فتح الذكاء الاصطناعي
he_il: אפשר Open AI
hi_in: ओपन AI सक्षम करें
zh_cn: 启用开放人工智能

source: Use Chat GPT capabilities in Block Editor
ar: استخدام إمكانيات Chat GPT في Block Editor
he_il: השתמש ביכולות Chat GPT בעורך החסימה
hi_in: ब्लॉक एडिटर में चैट GPT क्षमताओं का उपयोग करें
zh_cn: 在块编辑器中使用聊天 GPT 功能

source: Token
ar: رمز مميز
he_il: אֲסִימוֹן
hi_in: टोकन
zh_cn: 代币

source: e.g. ae2kgch7i
ar: على سبيل المثال ae2kgch7i
he_il: לְמָשָׁל ae2kgch7i
hi_in: जैसे ae2kgch7i
zh_cn: 例如 ae2kgch7i

source: Google Gemini
ar: جوجل الجوزاء
he_il: גוגל תאומים
hi_in: गूगल जेमिनी
zh_cn: 谷歌双子座

source: Enable Google Gemini
ar: تمكين Google Gemini
he_il: הפעל את Google Gemini
hi_in: Google जेमिनी सक्षम करें
zh_cn: 启用 Google 双子座

source: Use Google Gemini capabilities in Block Editor
ar: استخدام إمكانيات Google Gemini في محرر الكتل
he_il: השתמש ביכולות של Google Gemini ב-Block Editor
hi_in: ब्लॉक एडिटर में Google Gemini क्षमताओं का उपयोग करें
zh_cn: 在块编辑器中使用 Google Gemini 功能

source: Settings Saved.
ar: تم حفظ الإعدادات.
he_il: ההגדרות נשמרו.
hi_in: सेटिंग्स को सहेजा गया।
zh_cn: 设置已保存。
